# GBXMLImportOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GBXMLImportOptions Constructor
GBXMLImportOptions Class See Also
---
Default constructor. Sets all options to their default values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public GBXMLImportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
GBXMLImportOptions()
```

# See Also
GBXMLImportOptions Class
Autodesk.Revit.DB Namespace